#include <iostream>
#include <math.h>
using namespace std;
int main()
{
    float n;
    int k;

    cin >> n >> k;

    for (int i = 1; i <= k ; i++)
    {
        n /= 2;
    }
    
    cout << floor(n);

    return 0;
}

//در ابتدا دو عدد «اِن» و «کا» به برنامه ورودی‌ داده می‌شود
//و سپس «اِن» را «کا» بار تقسیم بر ۲ می‌کند
//و در آخر مقدار کف جواب حاصل را به عنوان خروجی چاپ می‌کند.
//(کف یک عددی حقیقی، بزرگ‌ترین عدد صحیحی است که کوچکتر یا مساوی آن عدد است.)
//−2 000 000 ≤ n ≤ 2 000 000
//0 ≤ k ≤ 50