#include <iostream>
using namespace std;
int main()
{
    int a, b, Sum = 0, n = 200, X[n], W = 0, q = 0;

    cin >> a >> b;

    for (int i = a+1 ; i < b ; i++)
    {
        for (int j = 1 ; j <= i ; j++)
        {
            if ( i % j == 0)
            {
                Sum += j;
            }
        }

        if ( Sum == i+1)
        {   
            int NevermindThisOne = 0;

            for ( q ; NevermindThisOne == 0 ; q++ )
            {
                X[q] = i;
                W += 1;
                NevermindThisOne = 1;
            }
            
        }
        
        Sum = 0;
        
    }

    for ( q = 0 ; q < W; q++)
    {
        cout << X[q];

        if ( q != W-1 )
        {
            cout << ",";
        }
        
    }
    
    
    
}

// برنامه‌ای بنویسید که از کاربر دو سر یک بازه را گرفته 
//مانند « ( بی ، آ )‌ » و اعداد اول داخل آن بازه را چاپ کند. 
//اعداد خروجی باید با علامت کاما (,) از هم جدا شوند. 
//ابتدا و انتهای بازه نباید در نظر گرفته شوند.
//ورودی: در خط اول «آ» ابتدای بازه و
//در خط دوم «بی» انتهای بازه به شما داده می‌شود.
// 1 <= a <= b <= 200
//خروجی: اعداد اول را از کوچک به بزرگ
//و جدا شده با کاما از هم چاپ کنید.